In [1]:
#Markdown - HTML

In [2]:
#Import the required libraries

import pandas as pd

In [3]:
# Shift + Enter (Runs and add a new cells)

In [4]:
#Data Structures

#Two types of Data Strcutures
#1D and 2D

#1D data structure are also known as SERIES (1 column)
#2D data strucutre are knowns as DATAFRAMES

### Series

In [5]:
s = pd.Series([0.1,0.2,0.3,0.4])

s

0    0.1
1    0.2
2    0.3
3    0.4
dtype: float64

In [6]:
s_range = pd.Series(range(1,10))

s_range

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [8]:
s[1]

0.2

In [10]:
s[3]

0.4

In [11]:
s2 = pd.Series([1,2,3,4], index=['a','b','c','d'])

s2

a    1
b    2
c    3
d    4
dtype: int64

In [12]:
s2[3]

4

In [13]:
s2['d']

4

In [14]:
#we can create a series using a dictionary

pop_dict = {'Singapore':5.5,
           'Indonesia':11.5,
           'Italy':15.3,
           'UK':65,
           'Netherlands':17.2}

pop_series = pd.Series(pop_dict)

pop_series

Singapore       5.5
Indonesia      11.5
Italy          15.3
UK             65.0
Netherlands    17.2
dtype: float64

In [15]:
type(pop_series)

pandas.core.series.Series

In [17]:
pop_series[2]

15.3

In [18]:
pop_series['Italy']

15.3

### DATAFRAMES

In [35]:
data = {'country':['Singapore','France','Germany'],
       'population':[5.5, 64, 82],
        'area':[31000, 672000, 360000],
        'capital':['Singapore', 'Paris', 'Berlin']}

countries = pd.DataFrame(data)

countries

     country  population    area    capital
0  Singapore         5.5   31000  Singapore
1     France        64.0  672000      Paris
2    Germany        82.0  360000     Berlin

In [36]:
#change country column to index

countries = countries.set_index('country')

countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
France           64.0  672000      Paris
Germany          82.0  360000     Berlin

In [37]:
countries['area']

country
Singapore     31000
France       672000
Germany      360000
Name: area, dtype: int64

In [38]:
type(countries['area'])

pandas.core.series.Series

In [39]:
countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
France           64.0  672000      Paris
Germany          82.0  360000     Berlin

In [40]:
#You can perfrom certain operations on series and DataFrames

#We want to calculate the population density of all the countries

#pop_density = population/area

countries['population']/countries['area']

country
Singapore    0.000177
France       0.000095
Germany      0.000228
dtype: float64

In [41]:
countries['area'].max()

672000

In [42]:
pop_series

Singapore       5.5
Indonesia      11.5
Italy          15.3
UK             65.0
Netherlands    17.2
dtype: float64

In [43]:
#I want to calculate the population of each country 
#relative to the population of Italy

pop_series/pop_series['Italy']

Singapore      0.359477
Indonesia      0.751634
Italy          1.000000
UK             4.248366
Netherlands    1.124183
dtype: float64

In [44]:
countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
France           64.0  672000      Paris
Germany          82.0  360000     Berlin

In [46]:
#Sort the dataframe on area

countries = countries.sort_values('area', ascending = True)

countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
Germany          82.0  360000     Berlin
France           64.0  672000      Paris

In [47]:
#describe function
countries.describe() #only numeric columns

       population           area
count    3.000000       3.000000
mean    50.500000  354333.333333
std     39.996875  320537.569301
min      5.500000   31000.000000
25%     34.750000  195500.000000
50%     64.000000  360000.000000
75%     73.000000  516000.000000
max     82.000000  672000.000000

In [48]:
#Indexing and slicing of data

countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
Germany          82.0  360000     Berlin
France           64.0  672000      Paris

In [49]:
l1 = ['a','b','c','d']

In [50]:
l1[2]

'c'

In [51]:
l1[-2]

'c'

In [52]:
#n:n-1
l1[1:3]

['b', 'c']

In [54]:
countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
Germany          82.0  360000     Berlin
France           64.0  672000      Paris

In [56]:
#iloc (index posision)
#loc (names)

#I want the population and capital of Singapore to France

#Loc - Row Location, Column Location
countries.loc['Singapore':'France', ['population','capital']]

           population    capital
country
Singapore         5.5  Singapore
Germany          82.0     Berlin
France           64.0      Paris

In [59]:
#I want the population and capital of Singapore and France
countries.loc[['Singapore','France'], ['population','capital']]

           population    capital
country
Singapore         5.5  Singapore
France           64.0      Paris

In [61]:
countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
Germany          82.0  360000     Berlin
France           64.0  672000      Paris

In [67]:
#Select a sunset of the data where the 
#area of the country is more than 100000
countries[countries['area']>100000]

         population    area capital
country
Germany        82.0  360000  Berlin
France         64.0  672000   Paris

In [68]:
countries['area']>100000

country
Singapore    False
Germany       True
France        True
Name: area, dtype: bool

In [69]:
countries

           population    area    capital
country
Singapore         5.5   31000  Singapore
Germany          82.0  360000     Berlin
France           64.0  672000      Paris

In [72]:
countries.loc['Singapore',['population','capital']] = 5.6,"Singapore City"

In [73]:
countries

           population    area         capital
country
Singapore         5.6   31000  Singapore City
Germany          82.0  360000          Berlin
France           64.0  672000           Paris

In [76]:
#Task:
#1. Update the population of singapore to 5.6
#2. Update the capital of singapore to singapore City

countries.loc['Singapore','population'] = 5.7

countries

           population    area         capital
country
Singapore         5.7   31000  Singapore City
Germany          82.0  360000          Berlin
France           64.0  672000           Paris

In [83]:
countries.loc['Singapore','capital'] = 'Singapore_city'

countries

           population    area         capital
country
Singapore         5.7   31000  Singapore_city
Germany          82.0  360000          Berlin
France           64.0  672000           Paris

In [84]:
#I want to ad a new column to the countries dataframe
#The new column is population_density, pop_density = population/area

countries['pop_density'] = countries['population']/countries['area']

countries

           population    area         capital  pop_density
country
Singapore         5.7   31000  Singapore_city     0.000184
Germany          82.0  360000          Berlin     0.000228
France           64.0  672000           Paris     0.000095

In [90]:
#rename population to pop

countries = countries.rename(columns={'population':'pop'})

countries

            pop    area         capital  pop_density
country
Singapore   5.7   31000  Singapore_city     0.000184
Germany    82.0  360000          Berlin     0.000228
France     64.0  672000           Paris     0.000095

In [91]:
#countries.drop

In [95]:
countries.loc['Singapore','pop']

5.7

In [143]:
countries['singapore','pop'] = 5.6

In [144]:
countries

            pop    area         capital  pop_density  (singapore, pop)
country
Singapore   5.7   31000  Singapore_city     0.000184               5.6
Germany    82.0  360000          Berlin     0.000228               5.6
France     64.0  672000           Paris     0.000095               5.6

In [149]:
countries.drop(countries.columns[[-1,]], axis=1, inplace=True)

In [150]:
countries

            pop    area         capital  pop_density
country
Singapore   5.7   31000  Singapore_city     0.000184
Germany    82.0  360000          Berlin     0.000228
France     64.0  672000           Paris     0.000095